#include <stdio.h>

//***************************************************
/**
 * 第13回 ポインタ
 * 例題5 比較
 *
 */
//***************************************************

int main(void)
{
    int a[] = {10, 20, 30, 40, 50};
    int *p;
    p = a;

    printf("aの値           = %d\n", a);    //変数aの値
    printf("a(16)の値       = %x\n", a);    //16進数
    printf("a(p)の値        = %p\n", a);    //アドレス
    printf("pの値           = %d\n", p);    //ポインタ変数pの値
    printf("a[0]の値        = %d\n", a[0]); //配列a[0]の値
    printf("*pの値          = %d\n", *p);   //ポインタ変数pが指すアドレスの中の値、配列の先頭の値

    return 0;
}