#include <stdio.h>

//***************************************************
/**
 * 第14回：構造体
 * 練習用
 */
//***************************************************

int main(void)
{
    //構造体の型宣言
    struct student
    {
        int no;                  //学籍番号
        char name[256];          //氏名
        int year;                //学年
        char student_class[256]; //クラス
    };

    //構造体の宣言と初期化の代入
    struct student student[200] = {
        {1, "ポチ", 3, "A-1"},
        {2, "タマ", 3, "A-2"},
        {3, "ケン", 3, "A-2"},
        {4, "シロ", 3, "A-3"},
        //※宣言時の順で格納する
    };

    return 0;
}
