//***************************************************
/** ソースコードの書き方【サンプルフォーマットを公開】
 * https://monozukuri-c.com/langc-sourcefile/
 * 11/25
 */
//***************************************************

#include <stdio.h>
#include <string.h>
#include "sub.h"

//------------------------------------------------
//  非公開マクロ定義
//------------------------------------------------
#define D_SUB_ID (50)

//------------------------------------------------
//  グローバル変数定義
//------------------------------------------------
static long gSystemflg = 0;

//------------------------------------------------
//  概要：サブ情報のプリント出力
//  引数：info    サブ情報
//  戻り値：正常／異常
//------------------------------------------------
int subPrint(S_SUBINFO info)
{
    printf("%s %d", info.str, info.num1);
    return 0;
}

//------------------------------------------------
//  概要：システムのエントリーポイント
//  戻り値：正常／異常
//------------------------------------------------
int main(void)
{
    S_SUBINFO info;

    gSystemflg = 1;

    info.num1 = D_SUB_ID;
    strcpy_s(info.str, D_SUB_NUM, "Hello");

    subPrint(info);
    return 0;
}

/**
 * ・ヘッダファイルの役割＝外部からサービスを利用する為の情報提供
 *・情報は、最小限に小さく閉じておくもの
 *
*/