//  多重インクルード防止
#ifndef SUB_H //SUB_Hが未定義のとき、以下を実行
#define SUB_H
//------------------------------------------------
#include <stdio.h>

//------------------------------------------------
//  マクロ定義(Macro definition)
//------------------------------------------------
#define D_SUB_NUM (10)

//------------------------------------------------
//  型定義(Type definition)
//------------------------------------------------
typedef struct
{
    long num1;
    char str[D_SUB_NUM];
} S_SUBINFO;

//------------------------------------------------
//  プロトタイプ定義(Prototype definition)
//------------------------------------------------
int subPrint(S_SUBINFO info);

//------------------------------------------------
#endif